export const patterns = {
    email: "^[^@]+@[^@]+\.[^@]+$",
    time: "^(([0|1][0-9])|([2][0-3])):([0-5][0-9])$",
    entityName: "^[A-Za-zА-Яа-яёЁЇїІіЄєҐґ'’,. -]+$",
    groupName: "^[А-ЯЁЇІіЄҐ]{2,3}[-][0-9]{2}[-][0-9]{1}$",
    numberUpTo255: "^([01]?[0-9]?[0-9]|2[0-4][0-9]|25[0-5])$",
    code: "^[0-9. ]*$",
    number: "^[0-9]*$",
    answerCount: "[0-9]?",
    studentSurname : "([A-Za-z\-]*|[ЄЇІїіА-ЩЬЮ-Яєа-щью-яҐґ'`\-]*)",
    studentName : "([A-Za-z\-]*|[ЄЇІїіА-ЩЬЮ-Яєа-щью-яҐґ'`\-]*)",
    studentFname : "([A-Za-z\-]*|[ЄЇІїіА-ЩЬЮ-Яєа-щью-яҐґ'`\-]*)",
    studentLogin : "[A-Za-z0-9_-]*",
    /*studentPassword : ,*/
    studentGradebook : "([a-zA-Z0-9_-]*|[ЄЇІїіА-ЩЬЮ-Яєа-щью-яҐґ0-9_-]*)",
    studentEmail : "^[a-zA-ZЄЇІїіА-ЩЬЮ-Яєа-щью-яҐґ0-9]+[a-zA-ZЄЇІїіА-ЩЬЮ-Яєа-щью-яҐґ0-9.!#$%&’*+/=?^_`{|}~-]*[a-zA-ZЄЇІїіА-ЩЬЮ-Яєа-щью-яҐґ0-9]*@[a-zA-ZЄЇІїіА-ЩЬЮ-Яєа-щью-яҐґ0-9]+(?:([a-zA-ZЄЇІїіА-ЩЬЮ-Яєа-щью-яҐґ0-9-]*[\.?]))+([a-zA-ZЄЇІїіА-ЩЬЮ-Яєа-щью-яҐґ]{2,6})$"
};
